import Layout from '@/Layout/Layout'
import CollapsibleSection from '@/components/CollapsibleSection'
import React, { useState } from 'react'
import Collapsible from 'react-collapsible'

const Questions = () => {
    const [data, setData] = useState([
        { title: "کارت ساز چیست ؟ ", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "کارت ساز چطور به کسب و کار من کمک میکند ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "آیا کارت ساز رایگان است ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "راه های ارتباطی در کارت ساز چگونه است ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "آیا اطلاعات من محفوظ است ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "کارت ساز توسط چه کسانی اداره می شود ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
        { title: "کارت ساز قابلیت پرداخت سبد خرید ها را نیز فراهم کرده است ؟", body: "کارت ساز یک سیستم نوین است که به شما اجازه میدهد برای مشتریان خود سبد خرید اختصاصی ایجاد کنید و سپس با ارسال لینک از آن ها بخواهید که سبد خرید خود را کامل کنند . در این حالت شما نیاز به یادداشت موارد خواسته شده ندارید و به راحتی میتوانید سفارش های خود را ثبت کنید . کارت ساز امده است تا زمان شما مدیریت شود , مشتریان خود را رهگیری" },
    ])
    return (
        <Layout>
            <div className='container mx-auto mt-20 p-6'>
                <h1 className='text-primary text-3xl mb-5'>سوالات متداول</h1>
                <div className='flex justify-center items-center flex-col'>
                    <CollapsibleSection faq={data} />
                </div>
            </div>
        </Layout>
    )
}

export default Questions;